import uvicorn
from fastapi import FastAPI
from .database import engine, Base
from fastapi.middleware.cors import CORSMiddleware
from .routers import router

app = FastAPI(title="Прототип терминала")

app.add_middleware(
    CORSMiddleware,
    allow_origins=["*"], 
    allow_credentials=True,
    allow_methods=["*"],
    allow_headers=["*"],
)

app.include_router(router)

@app.on_event("startup")
def on_startup():
    with engine.begin() as conn:
        Base.metadata.create_all(bind=engine)


if '__main__'==__name__:
    uvicorn.run("main.app", host= "0.0.0.0")

"""
READY   1. добавить доп информацию о контейнере(компания, тип контейнера, габарит, дату отправки и тд)

*    1. Тип, габарит контейнера:
        контейнера могут стоять только определенные друг на друге, сильно разные нельзя, так же и по габариту, только совпадающие
*    2. Компания: 
        показывать просто при поиске контейнера для доп сведений
*    3. Откуда будет уходить контейнер(если такая информация есть), дата отправки
        тоже доп информация для нейросети

            * 1. добавиь откуда пришел(путь) и откуда будет уходить,
              отдельная таблица с путями и информацикй о проходящих через него контейнеров

2. при погрузке и добавлении добавить номер пути и тип транспорта с которых будет принят/погружен конт

    1. создать уведомление для крановщика от приемосдатчика, что на определенный
       путь приехал контейнер и показать это со стороны крановщика

       1. Возможно создать платформу со стороны приемосдтчика

    * 2. добавить в журнал движений откуда пришел откуда ушел(транспорт+путь)
    * 3. при добавлении контейнера вносить информацию с какого пути был принят
    * 4. при погрузке с какого пути ушел

READY   3. Общий журнал движений подгружать в эксель таблицу 

4. обучить нейронку для подсказок куда выгоднее поставить(по возможности) и внедрить

    1. По возможности узнать от феско что за модель и какие данные были использованы
    2. Модель выбирает наилучшую из свободных ПОДХОДЯЩИХ учеек смотря по времени отправки, номеру пути и платформы для погрузки,
       размер контейнера(маленький контейнер перенести требует меньше энергии)

5. обьеденить это в одну систему для терминалов, у каждого терминала будет свой индекс и регистрацию добавить,
для приватизации, можно добавить карту уже оборудованых

    1. Добавить регистрацию и ввод кода сотрудника(выдается при регистрации терминалом), который работает только на одном терминале, где был выдан код,
       проиндексировать терминалы
    2. карта как обновление, если чето оборудую
"""