import uvicorn
from fastapi import FastAPI
from .database import engine, Base
from fastapi.middleware.cors import CORSMiddleware
from .routers import router

app = FastAPI(title="Прототип терминала")

app.add_middleware(
    CORSMiddleware,
    allow_origins=["*"], 
    allow_credentials=True,
    allow_methods=["*"],
    allow_headers=["*"],
)

app.include_router(router)

@app.on_event("startup")
def on_startup():
    with engine.begin() as conn:
        Base.metadata.create_all(bind=engine)

if '__main__'==__name__:
    uvicorn.run("main.app", host= "0.0.0.0")

"""
2. при погрузке и добавлении добавить номер пути и тип транспорта с которых будет принят/погружен конт

    1. создать уведомление для крановщика от приемосдатчика, что на определенный
       путь приехал контейнер и показать это со стороны крановщика

       1. Возможно создать платформу со стороны приемосдтчика

    * 2. добавить в журнал движений откуда пришел откуда ушел(транспорт+путь)
    * 3. при добавлении контейнера вносить информацию с какого пути был принят
    * 4. при погрузке с какого пути ушел

4. обучить нейронку для подсказок куда выгоднее поставить(по возможности) и внедрить

    2. Модель выбирает наилучшую из свободных ПОДХОДЯЩИХ учеек смотря по времени отправки, номеру пути и платформы для погрузки,
       размер контейнера(маленький контейнер перенести требует меньше энергии)

    3. Модель должна подсказывать, где лучшая пустая ячейка, исходя из времени и пути отправки, учитывая размер контейнера, чтобы ячейка подходила

    4. Реализация на фронтенде: добавление, перестановка и погрузка в 2 этапа. Сначала вводятся все данные кроме ячейки, после ввода нейросеть
       предлагает ячейку, но буде возможность ввести ячейку самостоятельно по нажатию кнопки хз.
       
    5. Реализация на бекенде: добавить доп эндпоинты добавления, перестановки и погрузки, но уже с нейросетью. 

7. обьеденить это в одну систему для терминалов, у каждого терминала будет свой индекс и регистрацию добавить,
для приватизации, можно добавить карту уже оборудованых

    1. Добавить регистрацию и ввод кода сотрудника(выдается при регистрации терминалом), который работает только на одном терминале, где был выдан код,
       проиндексировать терминалы
    2. карта как обновление, если чето оборудую
"""